 ![Emil]()

# Load & save different formats

## CSV files

You are working as a Data Analyst at Greenweez and someone from the marketing team asks you to help open `gwz_orders_samples_other_format.csv` as they are having some issues.

Import [gwz_orders_samples_other_format.csv](https://drive.google.com/file/d/14XBnRoi_S4PYi0JHQJHoRciwhXJZJUjX/view?usp=sharing) in colab and load it in a dataframe `df_orders`.

In [49]:
import pandas as pd

df_orders = pd.read_csv('gwz_orders_samples_other_format.csv')

Is there something wrong with this data ?
Display `df_orders` and have a look at the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html) to see how to solve this issue.

In [50]:
df_orders

     \tdate_date\torders_id\tcustomers_id\tcountry\tdepartment\ttotal_quantity\ttotal_turnover
0      0\t2019-01-01\t571\t560\tFRANCE\t77.0\t52\t92.71
1      1\t2019-01-01\t287\t282\tFRANCE\t17.0\t19\t97.94
2      2\t2019-01-01\t113\t113\tFRANCE\t50.0\t20\t94.15
3       3\t2019-01-01\t519\t510\tFRANCE\t22.0\t8\t73.78
4       4\t2019-01-01\t224\t222\tFRANCE\t13.0\t2\t27.99
...                                                 ...
9995  9995\t2019-01-13\t10207\t5293\tFRANCE\t44.0\t1...
9996  9996\t2019-01-13\t10155\t9724\tFRANCE\t5.0\t1\...
9997  9997\t2019-01-13\t10151\t9720\tFRANCE\t75.0\t2...
9998  9998\t2019-01-13\t10822\t10365\tFRANCE\t66.0\t...
9999  9999\t2019-01-13\t10638\t10189\tFRANCE\t81.0\t...

[10000 rows x 1 columns]

In [51]:
df_orders = pd.read_csv('gwz_orders_samples_other_format.csv', delimiter='\t')
df_orders.drop(columns=['Unnamed: 0'], inplace=True)

In [52]:
df_orders

,date_date,orders_id,customers_id,country,department,total_quantity,total_turnover
0,2019-01-01,571,560,FRANCE,77.0,52,92.71
1,2019-01-01,287,282,FRANCE,17.0,19,97.94
2,2019-01-01,113,113,FRANCE,50.0,20,94.15
3,2019-01-01,519,510,FRANCE,22.0,8,73.78
4,2019-01-01,224,222,FRANCE,13.0,2,27.99
...,...,...,...,...,...,...,...
9995,2019-01-13,10207,5293,FRANCE,44.0,19,77.71
9996,2019-01-13,10155,9724,FRANCE,5.0,1,63.33
9997,2019-01-13,10151,9720,FRANCE,75.0,24,83.47
9998,2019-01-13,10822,10365,FRANCE,66.0,15,39.41
9999,2019-01-13,10638,10189,FRANCE,81.0,11,91.76

3) Once you have managed to properly load the data, export it to a new `gwz_orders_samples_other_format_clean.csv` that the marketing team can use.

<details>
    <summary> Hint üîç </summary>
    The csv file doesn't need to include an index.  
    You should also make sure of the separator used!
    
</details>

In [53]:
df_orders.to_csv('gwz_orders_samples_other_format_clean.csv', index=False)

CSV files can be misleading at times, but these issues can be solved in Python!

## Dealing with json files

Execute the following cell to initialize a dictionary `d`

In [54]:
d = {"firstname": "leonardo",
     "lastname": "dicaprio",
     "job": "actor"}

Create a file named `actors.json` from `d`. Have a look at the lecture if you are lost with the syntax.

In [55]:
import json

with open('actors.json', 'w') as f:
    json.dump(d, f)

Open the new `actors.json` file and add a new key `nationality` (Leonardo Dicaprio is American). \
Save the result to the same file name. Check your file.

In [56]:
with open('actors.json', 'r') as f:
    content = json.load(f)

content

{'firstname': 'leonardo', 'lastname': 'dicaprio', 'job': 'actor'}

In [57]:
content['nationality'] = 'american'

with open('actors.json', 'w') as f:
    json.dump(content, f)

## Working with Excel files

For this part of the challenge, imagine you are owner of mutliple restaurants. You are currently doing your accounting on Excel.

Download the [Excel file](https://docs.google.com/spreadsheets/d/1BFFYMoV85sqMHxkl5DSk6dg21XmCLtlb/edit?usp=sharing&ouid=101172426362035713447&rtpof=true&sd=true) and explore it.

How many sheets are there?
What kind of data do you have?

> **Your Answer Here (Double click)**

Import the Excel file into your Google Colab environment.  
Load the data from the *first sheet* in a `df_sales_restaurant_1` DataFrame

In [58]:
df_sales_restaurant_1 = pd.read_excel('restaurants_accountability.xlsx')

In [59]:
df_sales_restaurant_1

        Date  Turnover  Cost  Margin
0 2021-12-01      1500  1200     300
1 2021-12-02      1200   900     300
2 2021-12-03      1900  1200     700
3 2021-12-04      2300  1500     800
4 2021-12-05      2100  1100    1000

How can you list all the sheets in an Excel file with Pandas ?  


<details>
    <summary> Hint üîç </summary>
    
`pd.ExcelFile()` [documentation](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.ExcelFile.html) can help ...
</details>

In [60]:
pd.ExcelFile('restaurants_accountability.xlsx').sheet_names

['Restaurant1', 'Restaurant2']

Now, load the data from the *second sheet* in a dataframe called `df_sales_restaurant_2`.


<details>
    <summary> Hint üîç </summary>
    How can you choose the sheet you want to access ? Consult the documentation or StackOverflow if you're having doubts.
</details>

In [61]:
df_sales_restaurant_2 = pd.read_excel('restaurants_accountability.xlsx', sheet_name='Restaurant2')
df_sales_restaurant_2

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,Date,Turnover,Cost,Margin
3,NaN,NaN,2021-12-01 00:00:00,700,600,100
4,NaN,NaN,2021-12-02 00:00:00,920,540,380
5,NaN,NaN,2021-12-03 00:00:00,810,600,210
6,NaN,NaN,2021-12-04 00:00:00,1000,300,700
7,NaN,NaN,2021-12-05 00:00:00,300,200,100

Do you notice anything unusual with this dataframe ? Inspect the sheet in the Excel file again, and try to understand the reason behind the weird format

> **Your Answer Here (Double click)**

Modify your previous line of code to load the data correctly. \
Have a look at the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html) if you're having doubts.

In [62]:
df_sales_restaurant_2 = pd.read_excel(
    'restaurants_accountability.xlsx', 
    sheet_name='Restaurant2', 
    skiprows=list(range(3)), 
    usecols=['Date', 'Turnover', 'Cost', 'Margin']
)
df_sales_restaurant_2

        Date  Turnover  Cost  Margin
0 2021-12-01       700   600     100
1 2021-12-02       920   540     380
2 2021-12-03       810   600     210
3 2021-12-04      1000   300     700
4 2021-12-05       300   200     100

Add in each dataframe a new `restaurant_id`column (id = 1 for restaurant_1 and id = 2 for restaurant_2) and concatenate the two dataframes into a single one named `df_sales`.  

Pay attention to the `axis`along which you will concatenate the two dataframes.

In [64]:
df_sales_restaurant_1['restaurant_id'] = 1
df_sales_restaurant_2['restaurant_id'] = 2

df_sales = pd.concat([df_sales_restaurant_1, df_sales_restaurant_2])

df_sales

        Date  Turnover  Cost  Margin  restaurant_id
0 2021-12-01      1500  1200     300              1
1 2021-12-02      1200   900     300              1
2 2021-12-03      1900  1200     700              1
3 2021-12-04      2300  1500     800              1
4 2021-12-05      2100  1100    1000              1
0 2021-12-01       700   600     100              2
1 2021-12-02       920   540     380              2
2 2021-12-03       810   600     210              2
3 2021-12-04      1000   300     700              2
4 2021-12-05       300   200     100              2

Export the concatenated dataframe to a new `restaurants_accountability_full.xlsx` file in a sheet called `All`

In [65]:
df_sales.to_excel('restaurants_accountability_full.xlsx')